1c-desktop-src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c-desktop-src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c-desktop-src/HTTPServices/users/Ext/Module.bsl
Функция getUserGET(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	
	ЗапросПользователи = Новый Запрос; 
	
	Если Логин <> "" Тогда
		ЗапросПользователи.Текст = "ВЫБРАТЬ
		               |    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
		               |    Пользователи.Наименование КАК Наименование,
		               |    Пользователи.Код КАК Код
		               |ИЗ
		               |    Справочник.Пользователи КАК Пользователи
		               |ГДЕ
		               |    НЕ Пользователи.ПометкаУдаления
					   |	И Пользователи.Наименование = &Наименование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |    Наименование";
		
		ЗапросПользователи.УстановитьПараметр("Наименование", Логин);
		
	Иначе
		ЗапросПользователи.Текст = "ВЫБРАТЬ	
		|    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
        |    Пользователи.Наименование КАК Наименование,
        |    Пользователи.Код КАК Код
        |ИЗ
        |    Справочник.Пользователи КАК Пользователи
        |ГДЕ
        |    НЕ Пользователи.ПометкаУдаления
        |
        |УПОРЯДОЧИТЬ ПО
        |    Наименование";
		
		КонецЕсли;		

		РезультатЗапроса = ЗапросПользователи.Выполнить();

	МассивПользователей= Новый Массив; //1

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл

	    ДанныеПользователя = Новый Структура; //2
	    ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка));
	    ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
	    ДанныеПользователя.Вставить("code", Строка(Выборка.Код));

	    МассивПользователей.Добавить(ДанныеПользователя); //3

	КонецЦикла;

	Ответ = Новый HTTPСервисОтвет(200); //4

	ЗаписьJSON = Новый ЗаписьJSON; //5
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивПользователей);
	СтрокаОтвета = ЗаписьJSON.Закрыть();

	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета); //6

	Возврат Ответ; //7
КонецФункции

Функция createUsercreate(Запрос)
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("phone"));
	
	Попытка
		   НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		   НовыйПользовательИБ.Имя = Логин;
		   НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		   НовыйПользовательИБ.Записать();
		   
		   ТекущийПользователь = Справочники.Контрагенты.СоздатьЭлемент();
		   ТекущийПользователь.Наименование = Логин;
		   ТекущийПользователь.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент;
		   ТекущийПользователь.КонтактныйТелефон = Телефон;
		   ТекущийПользователь.Комментарий = "Пользователь создан в мобильном приложении";
		   ТекущийПользователь.Записать();
		   
		   НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		   НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
		   НовыйПользователь.Наименование = Логин;
		   НовыйПользователь.Клиент = ТекущийПользователь.Ссылка;
		   НовыйПользователь.Записать();
		   
			МассивПользователей = Новый Массив;
		   		   
		   	ДанныеПользователя = Новый Структура; 
		    ДанныеПользователя.Вставить("guid", Строка(НовыйПользователь.Клиент));
		    ДанныеПользователя.Вставить("name", Строка(НовыйПользователь.Наименование));
		    ДанныеПользователя.Вставить("code", Строка(НовыйПользователь.Код));

		    МассивПользователей.Добавить(ДанныеПользователя);
		   
		   ЗаписьJSON = Новый ЗаписьJSON;
		   ЗаписьJSON.УстановитьСтроку();
		   ЗаписатьJSON(ЗаписьJSON, МассивПользователей);
		   СтрокаОтвета = ЗаписьJSON.Закрыть();
		   
		   ТекстОтвета = "Регистрация прошла успешно";
		   Ответ = Новый HTTPСервисОтвет(200); 
		   
	   Исключение
		   
		   СтрокаОтвета = "Произошла ошибка при регистрации нового пользователя" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		   Ответ = Новый HTTPСервисОтвет(500);
	   КонецПопытки;
	   
	   Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	   
	   Возврат Ответ;
		   
КонецФункции
